---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoomUpperOffset
source: html/88bc5cb5-6fc5-7c8a-ef1b-0f548dc648ea.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoomUpperOffset Property

"Limit Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId RoomUpperOffset { get; }
```